
(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1)
                 (A x (- y 1))))))

; 2のy乗、ただし y = 0のとき 0
;(display (A 1 10))
; 前の積の2乗^(前の積)
;(display (A 2 4))
;(display (A 3 3))


; 0
;(A 1 0)
; 2
;(A 1 1)
; 4
;(A 1 2)
; 8
;(A 1 3)
; 16
;(A 1 4)


;(A 2 1) = 2
;(A 2 2) = 4
; 4^2
;(A 2 3) = 16
; 16^4
;(A 2 4) = 65536
;(display (A 2 5))


; 0
;(display (A 3 0))
; 2
;(display (A 3 1))
; 4
;(display (A 3 2))
; 65536
;(display (A 3 3))
;....
;(display (A 3 4))

; よくわからないので置き換えモデルしてみる
;
;
; (define (A x y)
;   (cond ((= y 0) 0)
;         ((= x 0) (* 2 y))
;         ((= y 1) 2)
;         (else (A (- x 1)
;                  (A x (- y 1))))))
;
;(A 3 3)
;(A (- 3 1) (A 3 (- 3 1)) )
;(A 2 (A 3 2) )
;(A 2 (A 3 2) )
;(A 2 (A (- 3 1) (A 3 (- 2 1))) )
;(A 2 (A 2 (A 3 1)) )
;(A 2 (A 2 2) )
; 上記の例より
;(A 2 4 )
;=65536


;ちなみに
;(A 2 2)
;(A (- 2 1) (A 2 (- 2 1)))
;(A 1 (A 2 1))
;(A 1 2)
; 2^2 = 4




; (define (f n) (A 0 n))
; (n>0のとき) 2n
; (n==0のとき) 0
;
; (define (g n) (A 1 n))
; (n>0のとき) 2^n
; (n==0のとき) 0
;
; (define (h n) (A 2 n))
; n = 0 のとき 0
; n = 1 のとき 1
; n > 2 のとき
; h(n) = h(n-1)^( h(n-2) )
;
; (define (k n) (* 5 n n))
; 5*n^2

