
(define (runtime)
  (use srfi-11)
  (let-values (((a b) (sys-gettimeofday)))
              (+ (* a 1000000) b)))

(define (square x)
 (* x x)
)

(define (smallest-divisor n)
  (find-divisor n 2))

(define (find-divisor n test-divisor)
  (cond ((> (square test-divisor) n) n)
        ((divides? test-divisor n) test-divisor)
        (else (find-divisor n (+ test-divisor 1)))))

(define (divides? a b)
  (= (remainder b a) 0))

(define (prime? n)
  (= n (smallest-divisor n)))

(define (timed-prime-test n)
  (newline)
  (display n)
  (start-prime-test n (runtime)))

(define (start-prime-test n start-time)
  (if (prime? n)
      (report-prime (- (runtime) start-time))
      #f
  )
)

(define (report-prime elapsed-time)
  (display " *** ")
  (display elapsed-time)
  #t
)



(define (search-for-primes n)
  (display " *** start ***")
  (search-for-primes-iter 0 n)
)

(define (search-for-primes-iter found n)
  (if (>= found 3)
      #t
      (cond ((timed-prime-test n)
             (search-for-primes-iter (+ 1 found) (+ n 1)))
             (else (search-for-primes-iter found (+ n 1)))
      )
  )
)

; 1000の実行結果
; 1000 以上の最も小さい3つの素数は, 1009, 1013, 1019
; 時間の推移 1:16, 2:14, 3:14
;(search-for-primes 1000)
; *** start ***
; 1000
; 1001
; 1002
; 1003
; 1004
; 1005
; 1006
; 1007
; 1008
; 1009 *** 16
; 1010
; 1011
; 1012
; 1013 *** 14
; 1014
; 1015
; 1016
; 1017
; 1018
; 1019 *** 14



; 10000の実行結果
; 10000 以上の最も小さい3つの素数は, 10007, 10009, 10037
; 時間の推移 1:29, 2:30, 3:28
;(search-for-primes 10000)
; *** start ***
; 10000
; 10001
; 10002
; 10003
; 10004
; 10005
; 10006
; 10007 *** 29
; 10008
; 10009 *** 30
; 10010
; 10011
; 10012
; 10013
; 10014
; 10015
; 10016
; 10017
; 10018
; 10019
; 10020
; 10021
; 10022
; 10023
; 10024
; 10025
; 10026
; 10027
; 10028
; 10029
; 10030
; 10031
; 10032
; 10033
; 10034
; 10035
; 10036
; 10037 *** 28



; 100000の実行結果
; 100000 以上の最も小さい3つの素数は100003, 100019, 100043
; 時間の推移, 1:91, 2:91, 3:91
;(search-for-primes 100000)
; *** start ***
; 100000
; 100001
; 100002
; 100003 *** 91
; 100004
; 100005
; 100006
; 100007
; 100008
; 100009
; 100010
; 100011
; 100012
; 100013
; 100014
; 100015
; 100016
; 100017
; 100018
; 100019 *** 91
; 100020
; 100021
; 100022
; 100023
; 100024
; 100025
; 100026
; 100027
; 100028
; 100029
; 100030
; 100031
; 100032
; 100033
; 100034
; 100035
; 100036
; 100037
; 100038
; 100039
; 100040
; 100041
; 100042
; 100043 *** 91



; 1000000の実行結果
; 1000000 以上の最も小さい3つの素数は1000003, 1000033, 1000037
; 時間の推移, 1:285, 2:283, 3:288
;(search-for-primes 1000000)
; *** start ***
; 1000000
; 1000001
; 1000002
; 1000003 *** 285
; 1000004
; 1000005
; 1000006
; 1000007
; 1000008
; 1000009
; 1000010
; 1000011
; 1000012
; 1000013
; 1000014
; 1000015
; 1000016
; 1000017
; 1000018
; 1000019
; 1000020
; 1000021
; 1000022
; 1000023
; 1000024
; 1000025
; 1000026
; 1000027
; 1000028
; 1000029
; 1000030
; 1000031
; 1000032
; 1000033 *** 283
; 1000034
; 1000035
; 1000036
; 1000037 *** 288


;;;;;;;;;;;;;;;;;;;;;;;

; 時間の推移 1:16, 2:14, 3:14
; 時間の推移 1:29, 2:30, 3:28
; 時間の推移 1:91, 2:91, 3:91
; 時間の推移 1:285, 2:283, 3:288
; 事実 3.1 倍くらいになっている

